/*

My Custom JS
============

Author:  Brad Hussey
Updated: August 2013
Notes:	 Hand coded for Udemy.com

*/

$(function() {

	$('#alertMe').click(function(e) {
		// e.preventDefault(); // to prevent any other events
		$('#successAlert').slideDown();
	});

	$('[rel="tooltip"]').tooltip();


	var audioFilesNames=["","الأشخاص","العائلة","التعارف","في المدرسة","البلدان واللغات","القراءة والكتابة","الأعداد","أوقات الساعة","أيام الاسبوع","أمس_اليوم_غدا","الشهور","المشروبات","الانشطة و الأعمال","الألوان","الثمار و المواد الغذائية","فصول السنة و الطقس","في البيت","تنظيف المنزل","في المطبخ","محادثة قصيرة رقم -1","محادثة قصيرة رقم-2","محادثة قصيرة رقم-3","تعلم اللغات الأجنبية","المواعيد","في المدينة","في الطبيعة","في الفندق - الوصول","في الفندق - شكاوى"," ‫فى المطعم 1‬","فى المطعم 2‬","فى المطعم 3‬","فى المطعم 4‬","فى محطة القطار‬","فى القطار‬","فى المطار‬","المواصلات العامة القريبة‬","فى الطريق‬","فى التاكسى‬","تعطل السيارة‬","السؤال عن الطريق‬","التوجيه‬","زيارة المدينة‬","فى حديقة الحيوان‬","الخروج مساءً‬","فى السينما‬","فى صالة الديسكو‬","لإعداد للسفر‬","أنشطة العطلات‬","الرياضة‬","فى المسبح‬","قضاء الحاجات‬","فى المتجر‬","المحلات‬","التسوق‬","العمل‬","المشاعر ، الأحاسيس‬","عند الطبيب‬","أجزاء الجسم‬","في مكتب البريد‬","في البنك‬","الأعداد الترتيبية‬","طرح الأسئلة 1‬","طرح الأسئلة 2‬","النفي 1‬","النفي 2‬","ضمائر الملكية 1‬","ضمائر الملكية 2‬","كبير ـ صغير‬","يحتاج ـ يريد‬","الرغبة في فعل شيء‬","إرادة شيء‬","وجوب عمل شيء‬","السماح بعمل شيء‬","رجاء الشيء‬","إبداء الأسباب 1‬","إبداء الأسباب 2‬","إبداء الأسباب 3‬","الصفات 1‬","الصفات 2‬","الصفات 3‬","الماضي 1‬","الماضي 2‬","الماضي 3‬","الماضي 4‬","أسئلة – الماضي 1‬","أسئلة – الماضى 2‬","ماضي الأفعال المساعدة 1‬","ماضي الافعال المساعدة 2‬","الأمر 1‬","الأمر 2‬","الجمل الجانبية ","الجمل الجانبية ","الجمل التابعة باستعمال : إن كان، ما إذا كان‬","حروف العطف 1‬","حروف العطف 2‬","حروف العطف 3‬","أدوات الوصل 4‬","حروف العطف المزدوجة‬","حالة الإضافة‬","الظروف‬"];
	for (var i = 1; i < 101; i++) {
		var file = 'audio/ARNL'+("000" + i).slice(-3)+'.mp3';

		$('#audioOrderList').append(  '<div class="well"><li id="listNeedMargin"><p class="audioText">'+audioFilesNames[i]+'</p><audio controls><source src="'+file+'" type="audio/mpeg">Please <a href="'+file+'" download>download</a> the audio file.</audio></li></div><!-- end li -->');
	}

	// call json---------------for best schools
	$.getJSON('citiesSchools.json' , function(data){
		for (var key in data.utrecht) {
   				var school = data.utrecht[key];
				  $("#schools").append('<li class="col-sm-4"><h3>'+school.name+'</h3>'+school.location+'</li>');
		}
	//  document.getElementById("schools").innerHTML =
	//  obj.utrecht.school1.name ;

 })

});
